tests/load-test.yml
config:
# use 127.0.0.1 for local testing
#  target: "http://127.0.0.1:3000/api/v1"
  target: "http://backend:3000/api/v1"
  # CRITICAL for 30k RPS:
  http:
    pool: 100 # Keep connections alive to avoid socket exhaustion
    timeout: 10 # Short timeout so one slow request doesn't hang the test
  payload:
    - path: "./amount.csv"
      fields:
        - "amount"
      order: sequence
      skipHeader: true
    - path: "./users.csv"
      fields:
        - "email"
        - "username"
        - "password"
        - "id"
      order: sequence
      skipHeader: true
    - path: "./items.csv"
      fields:
        - "name"
        - "description"
        - "starting_bid"
        - "current_bid"
        - "end_time"
        - "item_id"
      order: sequence
      skipHeader: true
  phases:
    # Phase 1: Warm-up (1 minute)
    # Purpose: Initialize connection pools, JIT warm-up, and baseline check.
    - duration: 60
      arrivalRate: 10
      rampTo: 500
      name: "Warm-up"

    # Phase 2: Sustained Load (3 minutes)
    # Purpose: See how the DB handles consistent pressure.
    # 2,000 RPS is often the 'tipping point' for unoptimized DB writes.
    - duration: 180
      arrivalRate: 2000
      name: "Sustained Heavy Load"

    # Phase 3: The 30k Spike (2 minutes)
    # Purpose: The stress test. This is where MQ shines.
    - duration: 120
      arrivalRate: 2000
      rampTo: 30000
      name: "The 30k Spike"
  plugins:
    ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
    apdex:
      threshold: 100
    metrics-by-endpoint: {}
scenarios:
  - name: "Bid on an item"
    flow:
      - post:
          url: "/bid"
          headers:
            Content-Type: "application/json"
            X-Test-Auth:
              '{"id": {{ id }},
              "sub": {{ id }},
              "email": "{{ email }}",
              "username": "{{ username }}"}'
          json:
            user_id: "{{ id }}"
            item_id: "{{ item_id }}"
            bid_amount: "{{ amount }}"